In [83]:
import pandas as pd 
import seaborn as sns
import numpy as np
import os

In [84]:
ratings = pd.read_csv('./data/datasets/rating/data.csv', sep=',', encoding='latin-1')

In [85]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7028 entries, 0 to 7027
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   user id    7028 non-null   object
 1   movie id   7028 non-null   object
 2   rating     7028 non-null   int64
 3   timestamp  7028 non-null   object
dtypes: int64(1), object(3)
memory usage: 219.8+ KB

In [86]:
ratings['user id'].value_counts()

ur2403761      100
ur80394647     100
ur0478766      100
ur55644619     100
ur45706710     100
              ...
ur90907172       3
ur124569037      2
ur117662415      2
ur119783508      2
ur78483971       1
Name: user id, Length: 104, dtype: int64

In [87]:
user_ids = ratings['user id'].value_counts().index.tolist()
print(len(user_ids))

104

In [88]:
movie_ids = ratings['movie id'].value_counts().index.tolist()
print(len(movie_ids))

4965

In [89]:
from src.text_csv_utils import write_csv_file
RATING_OUTPUT = 'data/datasets/rating'
os.makedirs(RATING_OUTPUT, exist_ok = True)
rating_train_file_path = os.path.join(RATING_OUTPUT, 'train.csv')
rating_test_file_path = os.path.join(RATING_OUTPUT, 'test.csv')
write_csv_file([['user id', 'movie id', 'rating', 'timestamp']], rating_train_file_path, 'w')
write_csv_file([['user id', 'movie id', 'rating', 'timestamp']], rating_test_file_path, 'w')
for user_id in user_ids:
    rating = ratings[ratings['user id'] == user_id]
    n = len(rating)
    rating_train = rating[:n]
    rating_test = rating[n:]
    
    rating_train.to_csv(rating_train_file_path, mode='a', header=False, index=False)
    rating_test.to_csv(rating_test_file_path, mode='a', header=False, index=False)

In [90]:
rating_train = pd.read_csv('./data/datasets/rating/train.csv', sep=',')
rating_test = pd.read_csv('./data/datasets/rating/test.csv', sep=',')

In [91]:
rating_train.head()

     user id    movie id  rating             timestamp
0  ur2403761  tt14867006       1  Rated on 29 Nov 2021
1  ur2403761   tt1823059       1  Rated on 29 Nov 2021
2  ur2403761  tt10752004       7  Rated on 29 Nov 2021
3  ur2403761  tt13357086       4  Rated on 29 Nov 2021
4  ur2403761   tt4622108       4  Rated on 28 Nov 2021

In [92]:
len(rating_train['user id'].value_counts().index.tolist())

104

In [93]:
rating_test.head()

Empty DataFrame
Columns: [user id, movie id, rating, timestamp]
Index: []

In [94]:
len(rating_test['user id'].value_counts().index.tolist())

0

In [95]:
rating_train

          user id    movie id  rating             timestamp
0       ur2403761  tt14867006       1  Rated on 29 Nov 2021
1       ur2403761   tt1823059       1  Rated on 29 Nov 2021
2       ur2403761  tt10752004       7  Rated on 29 Nov 2021
3       ur2403761  tt13357086       4  Rated on 29 Nov 2021
4       ur2403761   tt4622108       4  Rated on 28 Nov 2021
...           ...         ...     ...                   ...
7023  ur117662415   tt8297022       2  Rated on 20 Aug 2020
7024  ur117662415   tt6468322       1  Rated on 01 May 2020
7025  ur119783508   tt0338621      10  Rated on 15 Jun 2020
7026  ur119783508   tt0111161       5  Rated on 15 Jun 2020
7027   ur78483971   tt3293184       8  Rated on 18 Jul 2017

[7028 rows x 4 columns]

In [96]:
user_ids = ratings['user id'].value_counts().index.tolist()
movie_ids = ratings['movie id'].value_counts().index.tolist()

In [97]:
format_user_id_dict = dict()
for i in range(len(user_ids)):
    format_user_id_dict.update({user_ids[i]: i})

In [98]:
format_movie_id_dict = dict()
for i in range(len(movie_ids)):
    format_movie_id_dict.update({movie_ids[i]: i})

In [99]:
rating_train.head()

     user id    movie id  rating             timestamp
0  ur2403761  tt14867006       1  Rated on 29 Nov 2021
1  ur2403761   tt1823059       1  Rated on 29 Nov 2021
2  ur2403761  tt10752004       7  Rated on 29 Nov 2021
3  ur2403761  tt13357086       4  Rated on 29 Nov 2021
4  ur2403761   tt4622108       4  Rated on 28 Nov 2021

In [100]:
formatted_user_id = []
formatted_movie_id = []
for i in range(len(rating_train)):
    user_id = rating_train.iloc[i]['user id']
    formatted_user_id.append(format_user_id_dict[user_id])
    movie_id = rating_train.iloc[i]['movie id']
    formatted_movie_id.append(format_movie_id_dict[movie_id])

rating_train['formatted user id'] = formatted_user_id
rating_train['formatted movie id'] = formatted_movie_id

In [101]:
formatted_user_id = []
formatted_movie_id = []
for i in range(len(rating_test)):
    user_id = rating_test.iloc[i]['user id']
    formatted_user_id.append(format_user_id_dict[user_id])
    movie_id = rating_test.iloc[i]['movie id']
    formatted_movie_id.append(format_movie_id_dict[movie_id])

rating_test['formatted user id'] = formatted_user_id
rating_test['formatted movie id'] = formatted_movie_id

In [102]:
rating_test

Empty DataFrame
Columns: [user id, movie id, rating, timestamp, formatted user id, formatted movie id]
Index: []

In [103]:
rating_train = rating_train[['formatted user id', 'formatted movie id', 'rating']]
rating_test = rating_test[['formatted user id', 'formatted movie id', 'rating']]

In [104]:
from src.text_csv_utils import write_csv_file
RATING_OUTPUT = './data/datasets/rating'
rating_train_file_path = os.path.join(RATING_OUTPUT, 'train.csv')
rating_test_file_path = os.path.join(RATING_OUTPUT, 'test.csv')
write_csv_file([['user id', 'movie id', 'rating']], rating_train_file_path, 'w')
write_csv_file([['user id', 'movie id', 'rating']], rating_test_file_path, 'w')
rating_train.to_csv(rating_train_file_path, mode='a', header=False, index=False)
rating_test.to_csv(rating_test_file_path, mode='a', header=False, index=False)

In [105]:
rating_train

      formatted user id  formatted movie id  rating
0                     0                4035       1
1                     0                 790       1
2                     0                 767       7
3                     0                4036       4
4                     0                4037       4
...                 ...                 ...     ...
7023                101                2156       2
7024                101                 262       1
7025                102                3243      10
7026                102                  35       5
7027                103                2953       8

[7028 rows x 3 columns]

In [106]:
rating_train = pd.read_csv('./data/datasets/rating/train.csv', sep=',')
rating_test = pd.read_csv('./data/datasets/rating/test.csv', sep=',')

In [107]:
rating_test

Empty DataFrame
Columns: [user id, movie id, rating]
Index: []